In [14]:
import pandas as pd


df_raw = pd.read_csv(r"..\data\processed\job_offers.csv", encoding="UTF-8", sep=';')

In [21]:
df_raw.head()

,name,company,technology,job,location_city,location_coutry,salary_low,salary_high,salary_currency,salary_avg,is_senior
0,quality assurance engineer/data analyst,Link Group Sp. z o. o.,sql,data analyst,Kraków,POL,12000,16000,PLN,14000.0,0
1,data analyst,PHLEXGLOBAL POLAND SP Z.O.O,NaN,data analyst,Lublin,POL,5000,7000,PLN,6000.0,0
2,data scientist,Samba TV,python,data analyst,Warszawa,POL,10000,16500,PLN,13250.0,0
3,data analyst (credit risk),AVENGA,NaN,data analyst,Warszawa,POL,5000,9000,PLN,7000.0,0
4,senior product manager,co.brick,NaN,data analyst,Gliwice,POL,12000,20000,PLN,16000.0,1

In [16]:
df = df_raw.copy()

In [17]:
df.groupby(by=["job"]).size()

job
data analyst      125
data engeenier     12
data scientist     14
dtype: int64

In [21]:
df.groupby(by=["job"])["salary_avg"]

<pandas.core.groupby.generic.SeriesGroupBy object at 0x0000021949CC45B0>

In [18]:
df.groupby(by=["location_city"]).size()

location_city
 Budapest     7
 Gliwice      4
 Katowice     4
 Kraków      10
 Lublin       4
 Warszawa    57
Zdalna       65
dtype: int64

In [19]:
df.groupby(by=["job", "is_senior"])["salary_avg"].agg(["mean", "min", "max"])

                                  mean      min      max
job            is_senior
data analyst   0          11951.650442   2800.0  26500.0
               1          16826.666667  16000.0  18480.0
data engeenier 0          15696.000000  10500.0  19500.0
               1          29161.000000  29161.0  29161.0
data scientist 0          16152.875000  11500.0  23000.0
               1          22510.000000  21500.0  23520.0

In [20]:
pd.pivot_table(
    data=df,
    index=['job'],
    columns=['location_city'],
    values=['salary_low'],
    aggfunc="min"
)

               salary_low                                                \
location_city    Budapest  Gliwice  Katowice   Kraków  Lublin  Warszawa
job
data analyst       7596.0  12000.0   14000.0   2600.0  5000.0    5000.0
data engeenier        NaN      NaN       NaN  10000.0     NaN    9000.0
data scientist    13927.0      NaN       NaN  18000.0     NaN   10000.0


location_city    Zdalna
job
data analyst     5000.0
data engeenier  15000.0
data scientist   8000.0

In [22]:
df.groupby(by="job")["salary_avg"].min()

job
data analyst       2800.0
data engeenier    10500.0
data scientist    11500.0
Name: salary_avg, dtype: float64